Catalogs/ФедеральныеВебСервисыЭМД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>ФедеральныеВебСервисыЭМД</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОтносительныйПутьКФайлуЭМД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументИнформационнойБазы</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДокументыРЭМД</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>emdrId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВерсии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пациент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КартотекаРЭМД</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранитьДо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстПоследнейОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отправить</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбновитьДанныеДокументаВРЭМД</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматФайлаДляРЭМД</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ФорматФайлаДляРЭМД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипРЭМД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыМДРегистрируемыхВРЭМД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстПоследнейОшибкиИЭМК</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторДокументаИЭМК</Name>
					<Comment>Идентификатор документа указанный в сообщении для ИЭМК</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторКонтейнераДокументаИЭМК</Name>
					<Comment>Идентификатор контейнера документа указанный в сообщении для ИЭМК</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправитьВИЭМК</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзмененияСодержимогоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЭлектронныеПодписиЭМД</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОтносительныйПутьКФайлуПодписиЭМД</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.СотрудникРЭМД</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РольРЭМД</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РолиПриПодписанииРЭМД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоПодписьМО</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СвязанныеДокументы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>emdrId</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодТипаРЭМД</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерВерсии</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипСвязи</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодOIDОрганизацииВладельца</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.OIDМедицинскойОрганизации</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИсторияИдентификаторов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>emdrId</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторДокумента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПомещенияВИсторию</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ОтложенноеПодписаниеЭП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>ОтложенноеПодписаниеЭП</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КоличествоПодписей</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СотрудникРЭМД</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РольПриПодписании</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РолиПриПодписанииРЭМД</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПодписываемыйОбъект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФедеральныеВебСервисыЭМД</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/ФедеральныеВебСервисыЭМД/Forms/СписокПодписейДляРЭМД/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Параметры.ДокументИнформационнойБазы) Тогда
		ЗаполнитьСписокПодписей(ЭтотОбъект.Параметры.ДокументИнформационнойБазы);

		СтатусРЭМД_ = ФедеральныеВебСервисыРЭМД.ПолучитьСтатусРегистрацииДокументаВРЭМД(ЭтотОбъект.Параметры.ДокументИнформационнойБазы);
		
		ЭтотОбъект.СтатусСтрокой = СтатусРЭМД_.СтатусСтрокой;
		ЭтотОбъект.КодСтатуса = СтатусРЭМД_.КодСтатуса;
		ЭтотОбъект.Описание = СтатусРЭМД_.Описание;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ОбменСРЭМД(Команда)
	ПараметрыФормы = Новый Структура("ДокументИнформационнойБазы", ЭтотОбъект.Параметры.ДокументИнформационнойБазы);
	ОткрытьФорму("Справочник.ФедеральныеВебСервисыЭМД.Форма.СообщенияОтправленныеВРЭМД", ПараметрыФормы);
КонецПроцедуры

&НаКлиенте
Процедура СписокПодписейСотрудникПодписантНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры


#КонецОбласти

#Область СлужебеныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьСписокПодписей(ДокументИнформационнойБазы)
	ЭтотОбъект.СписокПодписей.Очистить();
	
	// Получим ожидаемые подписи.
	СтрокаТЗЗаголовок1_ = ЭтотОбъект.СписокПодписей.Добавить();
	СтрокаТЗЗаголовок1_.ТекстЗаголовка = "Ожидаемые подписи (0):";
	СтрокаТЗЗаголовок1_.ЭтоЗоголовок = Истина;
	
	Запрос_ = Новый Запрос;
	Запрос_.Текст =
		"ВЫБРАТЬ
		|	ОтложенноеПодписаниеЭП.Сотрудник КАК Сотрудник,
		|	ОтложенноеПодписаниеЭП.КоличествоПодписей КАК КоличествоПодписей,
		|	ОтложенноеПодписаниеЭП.РольПриПодписании КАК РольПриПодписании
		|ИЗ
		|	РегистрСведений.ОтложенноеПодписаниеЭП КАК ОтложенноеПодписаниеЭП
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ФедеральныеВебСервисыЭМД КАК ЭМД
		|		ПО ОтложенноеПодписаниеЭП.ПодписываемыйОбъект = ЭМД.Ссылка
		|			И (ЭМД.ПометкаУдаления = ЛОЖЬ)
		|ГДЕ
		|	ЭМД.ДокументИнформационнойБазы = &ДокументИнформационнойБазы
		|
		|УПОРЯДОЧИТЬ ПО
		|	Сотрудник";
	
	Запрос_.УстановитьПараметр("ДокументИнформационнойБазы", ДокументИнформационнойБазы);
	Выборка_ = Запрос_.Выполнить().Выбрать();
	
	ДолжностиДляПодписания_ = Неопределено;
	КоличествоПодписей_ = 0;
	Пока Выборка_.Следующий() Цикл
		НоваяСтрокаТЗ_ = ЭтотОбъект.СписокПодписей.Добавить();
		
		Если ЗначениеЗаполнено(Выборка_.КоличествоПодписей) Тогда
			НоваяСтрокаТЗ_.КоличествоПодписей = Выборка_.КоличествоПодписей;
			КоличествоПодписей_ = КоличествоПодписей_ + Выборка_.КоличествоПодписей;
		Иначе
			КоличествоПодписей_ = КоличествоПодписей_ + 1;
		КонецЕсли;
		
		НоваяСтрокаТЗ_.ЭтоОжиданиеПодписи = Истина;
		
		Если Не ЗначениеЗаполнено(Выборка_.Сотрудник) И ЗначениеЗаполнено(Выборка_.РольПриПодписании) Тогда
			НоваяСтрокаТЗ_.Роль = Выборка_.РольПриПодписании;
			
			Если ДолжностиДляПодписания_ = Неопределено Тогда
				ДолжностиДляПодписания_ = ФедеральныеВебСервисыРЭМД.ПолучитьДолжностиДляПодписания(ДокументИнформационнойБазы);
			КонецЕсли;
			
			НайденныеДолжности_ = ДолжностиДляПодписания_.НайтиСтроки(Новый Структура("РольРЭМД", Выборка_.РольПриПодписании));
			
			СписокДолжностей_ = "";
			Для Каждого Должность_ Из НайденныеДолжности_ Цикл
				ДолжностьСсылка_ = ФедеральныеВебСервисыПереопределяемый.ПолучитьСсылкуПоКодуМинздрава(Должность_.КодМинздраваДолжности, "1.2.643.5.1.13.13.11.1002");
				Если СписокДолжностей_ = "" Тогда
					СписокДолжностей_ = Строка(ДолжностьСсылка_);
				Иначе
					СписокДолжностей_ = СписокДолжностей_ + "," + ДолжностьСсылка_;
				КонецЕсли;
			КонецЦикла;
			
			НоваяСтрокаТЗ_.ТекстСписокДолжностей = СписокДолжностей_;
		Иначе
			НоваяСтрокаТЗ_.СотрудникПодписант = Выборка_.Сотрудник;
			НоваяСтрокаТЗ_.Роль = ФедеральныеВебСервисыРЭМД.ПолучитьРольСотрудникаПриПодписанииПоДокументу(ДокументИнформационнойБазы, Выборка_.Сотрудник);
		КонецЕсли;
	КонецЦикла;
	
	Если КоличествоПодписей_ = 0 Тогда
		НоваяСтрокаТЗ_ = ЭтотОбъект.СписокПодписей.Добавить();
		НоваяСтрокаТЗ_.ТекстЗаписиОтсутствуют = "отсутствуют";
	Иначе
		СтрокаТЗЗаголовок1_.ТекстЗаголовка = стрЗаменить(СтрокаТЗЗаголовок1_.ТекстЗаголовка, "(0)", "(" + КоличествоПодписей_ + ")");
	КонецЕсли;
		
	// Получим поставленные подписи.
	СтрокаТЗЗаголовок2_ = ЭтотОбъект.СписокПодписей.Добавить();
	СтрокаТЗЗаголовок2_.ТекстЗаголовка = "Поставленные подписи (0):";
	СтрокаТЗЗаголовок2_.ЭтоЗоголовок = Истина;

	Запрос_ = Новый Запрос;
	Запрос_.Текст =
		"ВЫБРАТЬ
		|	ФедеральныеВебСервисыЭМДЭлектронныеПодписиЭМД.Сотрудник КАК Сотрудник,
		|	ФедеральныеВебСервисыЭМДЭлектронныеПодписиЭМД.РольРЭМД КАК РольРЭМД,
		|	ФедеральныеВебСервисыЭМДЭлектронныеПодписиЭМД.ЭтоПодписьМО КАК ЭтоПодписьМО
		|ИЗ
		|	Справочник.ФедеральныеВебСервисыЭМД.ЭлектронныеПодписиЭМД КАК ФедеральныеВебСервисыЭМДЭлектронныеПодписиЭМД
		|ГДЕ
		|	НЕ ФедеральныеВебСервисыЭМДЭлектронныеПодписиЭМД.Ссылка.ПометкаУдаления
		|	И ФедеральныеВебСервисыЭМДЭлектронныеПодписиЭМД.Ссылка.ДокументИнформационнойБазы = &ДокументИнформационнойБазы
		|
		|УПОРЯДОЧИТЬ ПО
		|	Сотрудник";

	Запрос_.УстановитьПараметр("ДокументИнформационнойБазы", ДокументИнформационнойБазы);
	Выборка_ = Запрос_.Выполнить().Выбрать();
	
	КоличествоПодписей_ = 0;
	Пока Выборка_.Следующий() Цикл
		НоваяСтрокаТЗ_ = ЭтотОбъект.СписокПодписей.Добавить();
		НоваяСтрокаТЗ_.ЭтоОжиданиеПодписи = Ложь;
		НоваяСтрокаТЗ_.СотрудникПодписант = Выборка_.Сотрудник;
		НоваяСтрокаТЗ_.Роль = Выборка_.РольРЭМД;
		НоваяСтрокаТЗ_.ЭтоПодписьМО = Выборка_.ЭтоПодписьМО;
		
		Если Выборка_.ЭтоПодписьМО Тогда
			НоваяСтрокаТЗ_.ТекстПодписьМО = "Подпись МО";
			НоваяСтрокаТЗ_.СотрудникПодписант = Неопределено;
		КонецЕсли;
		
		КоличествоПодписей_ = КоличествоПодписей_ + 1;
	КонецЦикла;
	
	Если КоличествоПодписей_ = 0 Тогда
		НоваяСтрокаТЗ_ = ЭтотОбъект.СписокПодписей.Добавить();
		НоваяСтрокаТЗ_.ТекстЗаписиОтсутствуют = "отсутствуют";
	Иначе
		СтрокаТЗЗаголовок2_.ТекстЗаголовка = стрЗаменить(СтрокаТЗЗаголовок2_.ТекстЗаголовка, "(0)", "(" + КоличествоПодписей_ + ")");
	КонецЕсли;
КонецПроцедуры


#КонецОбласти
